<template>
  <div>
    <mt-header title="用户注册协议">
      <router-link to="/" slot="left">
        <mt-button icon="back">返回</mt-button>
        <!--<mt-button @click="handleClose">close</mt-button>-->
      </router-link>
      <!--<mt-button icon="more" slot="right"></mt-button>-->
    </mt-header>
    <!--<h3>用户注册协议</h3>-->
    <p>
      本协议由你与本游戏所有者深圳市优狐科技有限公司（以下简称为“我司”）之间签订，请你仔细阅读本协议，当你成功开通本平台账号后即视为你已同意本协议全部条款，本协议即构成对双方有约束力的法律文件。
      1.你以任何方式登陆本网页，或直接、间接使用本网页资料者，均被视为自愿接受本网站相关声明和用户服务协议的约束。
      2.你应在本游戏管理平台绑定个人储蓄银行卡，仅用于我司向你发放佣金使用，银行卡一旦绑定即视为你明确同意使用该绑定的银行卡接收我司每周期自动发放的佣金，由于你的自身失误造成的佣金误发、延发等责任由你自行承担，我司不承担任何责任。
      3.你应当在开通完管理后台后及时绑定银行卡，并妥善保管好自己的管理后台的用户名和密码，以免信息泄漏被他人利用，若因各位代理自身保管不当导致银行卡信息泄露，我司不承担任何责任。
      4.你在本游戏管理平台绑定银行卡后，不得随意要求更换银行卡，如遇特殊情况必须更换，可以通过上级代理向我司提出更换申请，并应提供以下资料，我司审核完毕后决定是否予以更改。资料包括:
      （1）带有本人姓名，身份证号码，管理后台ID，及手动签名的两份免责声明，强调因解绑出现的任何风险与他公司无关。
      （2）手执身份证的人和身份证的合影照片。
      （3）近1个月的管理后台流水周截图。
      5.除本游戏管理后台上注明之服务条款外，其它因你自身不当使用本游戏管理平台而导致的任何意外、疏忽以及因此造成的任何经济损失由你自行承担，我司概不负责，亦不承担任何法律责任。
      6.对于因不可抗力或因黑客攻击、通讯线路中断等不能控制的原因造成的网络服务中断或其他缺陷，导致用户不能及时收到对应佣金，我司不承担任何法律责任，但我司将尽快采取补救措施，以减少有关损失或影响。
      7.本游戏旨在为大众提供一种健康、益智的娱乐休闲方式，请你务必严格遵守我国法律法规，遵守社会公德，严禁利用本游戏从事赌博、诈骗、非法套现、洗钱、淫秽色情等违法犯罪活动，否则，由此产生的一切法律后果由你们自行承担，与我司无关。
      8.你应对本协议所有内容进行保密，保密期限不限于本协议有效期限，也不因本协议解除、终止、无效或被撤销而失效。若你不当泄露本管理平台及我司有关机密，我司将随时保留法律追究之权利。
      9.我司有权结合国家政策、法律法规的变化等情况随时修订、更新本协议有关内容，并在本管理平台上予以公告，若你继续使用本管理平台，则视为你接受我司的全部修订和更新内容，若你不接受修订和更新内容，你应当立即注销本管理平台，若你不按期注销的，视为你仍认可我司全部之修订、更新内容。
      10.本协议未尽事宜双方均同意按照国家正常和有关法律法规之规定执行，本管理平台的相关声明版权及其修改权、更新权和最终解释权均属我司所有。
      <br>
      <br>
    </p>
  </div>
</template>

<script>
  export default {
    name: 'Agreenemnt',
    data() {
      return {
      }
    }
  }
</script>

<style>
  h3{
    text-align:center;
  }

  p{
    white-space: pre-line;
    width:80%;
    margin:0 auto;
    line-height:1.6;
  }
</style>

